mySatcom/Bridge/Ecuador_Request_KO_QA.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:Action>http://tempuri.org/IBridge/ProcesarComprobante</wsa:Action>
		<wsa:To>https://bridge-testing.mysatcomla.com/WcfBridge.svc</wsa:To>
	</soap:Header>
	<soap:Body>
		<ns0:ProcesarComprobante xmlns:ns0="http://tempuri.org/">
			<ns0:strRequerimiento>&lt;Requerimiento&gt;&lt;Codigo&gt;01&lt;/Codigo&gt;&lt;NumeroDocumento&gt;0&lt;/NumeroDocumento&gt;&lt;Descripcion&gt;FACTURA&lt;/Descripcion&gt;&lt;FechaEmision&gt;06/05/2026&lt;/FechaEmision&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;4&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;15&lt;/Porcentaje&gt;&lt;BaseImponible&gt;403.28&lt;/BaseImponible&gt;&lt;Valor&gt;60.49&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;6&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;NO OBJETO IMPUE&lt;/Porcentaje&gt;&lt;BaseImponible&gt;5.50&lt;/BaseImponible&gt;&lt;Valor&gt;0.00&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;Pagos&gt;&lt;Pago&gt;&lt;CodigoFormaPago&gt;19&lt;/CodigoFormaPago&gt;&lt;Total&gt;509.59&lt;/Total&gt;&lt;/Pago&gt;&lt;/Pagos&gt;&lt;InformacionAdicional&gt;&lt;Campo id="1 "&gt;&lt;Descripcion&gt;RESERVA&lt;/Descripcion&gt;&lt;Valor&gt;0137536328&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="2 "&gt;&lt;Descripcion&gt;FECHA LLEGADA&lt;/Descripcion&gt;&lt;Valor&gt;02/07/2025&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="3 "&gt;&lt;Descripcion&gt;FECHA SALIDA&lt;/Descripcion&gt;&lt;Valor&gt;04/07/2025&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="4 "&gt;&lt;Descripcion&gt;NOMBRE HUESPED&lt;/Descripcion&gt;&lt;Valor&gt;PALATNIK BELOVA, OLGA&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="5 "&gt;&lt;Descripcion&gt;NUMERO FACTURA&lt;/Descripcion&gt;&lt;Valor&gt;EQU1000006&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="6 "&gt;&lt;Descripcion&gt;FECHA FACTURA&lt;/Descripcion&gt;&lt;Valor&gt;02/07/2025&lt;/Valor&gt;&lt;/Campo&gt;&lt;Campo id="7 "&gt;&lt;Descripcion&gt;AGENTE DE RETENCION&lt;/Descripcion&gt;&lt;Valor&gt;RESOLUCIÓN N° 1&lt;/Valor&gt;&lt;/Campo&gt;&lt;/InformacionAdicional&gt;&lt;Propina&gt;40.32&lt;/Propina&gt;&lt;RucEmisor&gt;1791325524001&lt;/RucEmisor&gt;&lt;Establecimiento&gt;001&lt;/Establecimiento&gt;&lt;Punto&gt;009&lt;/Punto&gt;&lt;Moneda&gt;DÓLAR&lt;/Moneda&gt;&lt;TotalConImpuestos&gt;509.59&lt;/TotalConImpuestos&gt;&lt;TotalSinImpuestos&gt;408.78&lt;/TotalSinImpuestos&gt;&lt;Cliente&gt;&lt;RazonSocial&gt;OLGA PALATNIK BELOVA&lt;/RazonSocial&gt;&lt;Direccion&gt;--     0&lt;/Direccion&gt;&lt;TipoIdentificacion&gt;06&lt;/TipoIdentificacion&gt;&lt;NumeroIdentificacion&gt;72345678-9&lt;/NumeroIdentificacion&gt;&lt;email&gt;TESTEY123456789@GMAIL.COM&lt;/email&gt;&lt;Telefonos&gt;&lt;Telefono id="1"&gt;&lt;Numero&gt;000000000000000&lt;/Numero&gt;&lt;/Telefono&gt;&lt;/Telefonos&gt;&lt;/Cliente&gt;&lt;Detalles&gt;&lt;Detalle id="1 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;200.00&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;BB&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;BB&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Alojamiento y desayuno&lt;/Descripcion&gt;&lt;ValorUnitario&gt;200.00&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;4&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;15&lt;/Porcentaje&gt;&lt;BaseImponible&gt;200.00&lt;/BaseImponible&gt;&lt;Valor&gt;30.00&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;Detalle id="2 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;1.64&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;OTH2&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;OTH2&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Seguro Hotelero&lt;/Descripcion&gt;&lt;ValorUnitario&gt;1.64&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;4&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;15&lt;/Porcentaje&gt;&lt;BaseImponible&gt;1.64&lt;/BaseImponible&gt;&lt;Valor&gt;0.25&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;Detalle id="3 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;2.75&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;TTAX&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;TTAX&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Tasa Turística&lt;/Descripcion&gt;&lt;ValorUnitario&gt;2.75&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;6&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;NO OBJETO IMPUE&lt;/Porcentaje&gt;&lt;BaseImponible&gt;2.75&lt;/BaseImponible&gt;&lt;Valor&gt;0.00&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;Detalle id="4 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;200.00&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;BB&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;BB&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Alojamiento y desayuno&lt;/Descripcion&gt;&lt;ValorUnitario&gt;200.00&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;4&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;15&lt;/Porcentaje&gt;&lt;BaseImponible&gt;200.00&lt;/BaseImponible&gt;&lt;Valor&gt;29.99&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;Detalle id="5 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;1.64&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;OTH2&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;OTH2&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Seguro Hotelero&lt;/Descripcion&gt;&lt;ValorUnitario&gt;1.64&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;4&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;15&lt;/Porcentaje&gt;&lt;BaseImponible&gt;1.64&lt;/BaseImponible&gt;&lt;Valor&gt;0.25&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;Detalle id="6 "&gt;&lt;Cantidad&gt;1.000 &lt;/Cantidad&gt;&lt;SubTotal&gt;2.75&lt;/SubTotal&gt;&lt;Producto&gt;&lt;Codigo&gt;TTAX&lt;/Codigo&gt;&lt;CodigoAuxiliar&gt;TTAX&lt;/CodigoAuxiliar&gt;&lt;Descripcion&gt;Tasa Turística&lt;/Descripcion&gt;&lt;ValorUnitario&gt;2.75&lt;/ValorUnitario&gt;&lt;/Producto&gt;&lt;Impuestos&gt;&lt;Impuesto&gt;&lt;CodigoImpuesto&gt;2&lt;/CodigoImpuesto&gt;&lt;CodigoPorcentaje&gt;6&lt;/CodigoPorcentaje&gt;&lt;Porcentaje&gt;NO OBJETO IMPUE&lt;/Porcentaje&gt;&lt;BaseImponible&gt;2.75&lt;/BaseImponible&gt;&lt;Valor&gt;0.00&lt;/Valor&gt;&lt;/Impuesto&gt;&lt;/Impuestos&gt;&lt;/Detalle&gt;&lt;/Detalles&gt;&lt;/Requerimiento&gt;</ns0:strRequerimiento>
			<ns0Comprimido>false</ns0Comprimido>
		</ns0:ProcesarComprobante>
	</soap:Body>
</soap:Envelope>